Revit 2027 API
Metal.MetalPatternShader Property
 The property labeled "Image" from the "Metal" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string MetalPatternShader { get; }
Public Shared ReadOnly Property MetalPatternShader As String
	Get
public:
static property String^ MetalPatternShader {
	String^ get ();
}
static member MetalPatternShader : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyReference" and will only contain a reference to a connected image.
See Also
Reference
Metal Class
Autodesk.Revit.DB.Visual Namespace